import UIKit

var main = ["Тигры", "Львы", "Орлы", "Не блондинки", "Девочки - припевочки", "Мальчики - зайчики", "Две бороды", "Муза Конфуза", "Умники", "Везунчики", "Победители по жизни", "Стражи бара", "Время офигительных историй", "Случайные пассажиры", "Эрудиты", "Агенты 007", "ФСБшники", "Шерлоки", "Третье колено", "Злые хомяки", "Вакцинированные", "Красавица и чудовище", "ЗОЖники", "Шерлок и его команда", "Семейка Адамсов", "Курятник", "Новички", "Смешарики", "Бригада кунг-фу", "Кто спать , кто за добавкой", "Команда Якубовича", "Амазонки с бензоколонки", "Девичник", "Карты, деньги, два пивка", "Антиваксеры", "Виа Грабля", "Медведи", "Кто их вообще позвал?", "Без баб", "Пенсия", "Старперы", "Львицы", "Дамы из инстаграмма", "Панды-засыпанды", "Мушкетеры", "Интеллигенция", "Удалёнщики", "Дикари", "Мамонты", "Неудержимые", "Гномики", "Кнопочки", "Шулеры", "Конь в пальто", "Еще не вечер", "Бессмертный пони", "Братство кроликов", "Тугодумы", "Домашние пельмени", "Добби и его команда", "Пингвинята", "Тролли", "Ленивцы", "Хитрые лисы", "Мухи-повторюхи", "Гадкие Мы", "Акулы Алиаса", "Белые вороны", "Цыплята", "Крокодилы", "Пивоманы", "36 и 6", "Оловянные салатики", "Квентин Буратино", "Хитрые лисы", "Дуэт Котлетка с пюрешкой", "Жареные гвозди", "Единорожки", "Чемпионы", "Триумфаторы", "Легионеры", "Ночные жрицы", "Буква Ю", "Тиктокеры", "Бегущие за трендами", "Яблокоманы", "Поттероманы", "Домоседы", "Тусовщики", "Ждуны", "Винчестероманы", "Электронщики", "Хаслеры", "Майнеры", "Позитивчики", "Пятый элемент", "Пушка-ракета", "Угаран", "Флексеры", "Скамеры", "Играющие без правил", "Валенки", "Комплекс превосходства", "Мафиозники"]

var singleAR = [String]()
var doubleAR = [String]()

for i in 0...main.count - 1 {
    if !main[i].contains(" ") {singleAR.append(main[i])}
    else { doubleAR.append(main[i])}
}
print("Single - \(singleAR.count)")
print(singleAR)
print("Double - \(doubleAR.count)")
print(doubleAR)
